In [19]:
import numpy as np 
import pandas as pd 

data1 = np.random.randint(3, 10, size=5)
s1 = pd.Series(data1, index =['a', 'b', 'c', 'd', 'e'])
s1

a    4
b    3
c    5
d    3
e    6
dtype: int32

In [24]:
by_loc = s1[2:]
print("by_loc:\n", by_loc)

by_index = s1['c':'e']
print("by_index:\n", by_index)

by_loc:
 c    5
d    3
e    6
dtype: int32
by_index:
 c    5
d    3
e    6
dtype: int32

In [25]:
arr = {
    'year' : {'0': 2017, '1': 2018, '2':2019},
    'price' : {'0': 10, '1':20, "2": 30 }
}
df = pd.DataFrame(arr)
df

   year  price
0  2017     10
1  2018     20
2  2019     30

In [26]:
data2 = np.random.randint(5, 15, size=(5,3))
df_test = pd.DataFrame(data2, index = ['a', 'c', 'e', 'f', 'h'], columns = ['one', 'two', 'three'])
df_test

   one  two  three
a    7    5      6
c   13   13      6
e   12   13     10
f   13   13      6
h   12    8      7

In [30]:
df_test.loc["a", 'one'] = None
df_test.loc['c', 'two'] = -99
df_test.loc['c', 'three'] = -99
df_test.loc['a', 'two'] = -100
df_temp = df_test.reindex(columns=['one', 'two', 'three', 'four'], fill_value = "test")
df_change = df_temp.reindex(['a','b', 'c', 'd', 'e', 'f', 'g', 'h'])
df_change

    one    two  three  four
a   NaN -100.0    6.0  test
b   NaN    NaN    NaN   NaN
c  13.0  -99.0  -99.0  test
d   NaN    NaN    NaN   NaN
e  12.0   13.0   10.0  test
f  13.0   13.0    6.0  test
g   NaN    NaN    NaN   NaN
h  12.0    8.0    7.0  test

In [31]:
df_change.dropna()

    one   two  three  four
c  13.0 -99.0  -99.0  test
e  12.0  13.0   10.0  test
f  13.0  13.0    6.0  test
h  12.0   8.0    7.0  test

In [32]:
df_change.dropna(how='all')

    one    two  three  four
a   NaN -100.0    6.0  test
c  13.0  -99.0  -99.0  test
e  12.0   13.0   10.0  test
f  13.0   13.0    6.0  test
h  12.0    8.0    7.0  test

In [33]:
df_change.fillna(0)

    one    two  three  four
a   0.0 -100.0    6.0  test
b   0.0    0.0    0.0     0
c  13.0  -99.0  -99.0  test
d   0.0    0.0    0.0     0
e  12.0   13.0   10.0  test
f  13.0   13.0    6.0  test
g   0.0    0.0    0.0     0
h  12.0    8.0    7.0  test

In [34]:
df_change.drop_duplicates()

    one    two  three  four
a   NaN -100.0    6.0  test
b   NaN    NaN    NaN   NaN
c  13.0  -99.0  -99.0  test
e  12.0   13.0   10.0  test
f  13.0   13.0    6.0  test
h  12.0    8.0    7.0  test